In [13]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]), 
                  index= [2.5, 12.6, 4.8, 4.8, 2.5], 
                  columns=[48, 49, 50])

In [14]:
df.head()

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

In [15]:
df.reset_index(inplace=True, drop=True)

In [16]:
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3  40  50  60
4  23  35  37

In [18]:
df.loc[5] = [1, 2, 3]

In [19]:
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3  40  50  60
4  23  35  37
5   1   2   3

In [24]:
df.drop_duplicates(keep='last', ignore_index=True)

   48  49  50
0   4   5   6
1   7   8   9
2  40  50  60
3  23  35  37
4   1   2   3

In [25]:
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3  40  50  60
4  23  35  37
5   1   2   3

In [29]:
df.loc[3][48] = 41

In [30]:
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3  41  50  60
4  23  35  37
5   1   2   3

In [34]:
new_col = {48 : 1,
           49 : 2,
           50 : 3,}

df.rename(columns=new_col, inplace=True)
df.head()

    1   2   3
0   1   2   3
1   4   5   6
2   7   8   9
3  41  50  60
4  23  35  37

In [36]:
df = pd.DataFrame(data=np.array([["Awful", "Poor", "OK"], ["OK", "Acceptable", "Perfect"], ["Poor", "Poor", "OK"]]), columns=['A', 'B', 'C'])
display(df)

       A           B        C
0  Awful        Poor       OK
1     OK  Acceptable  Perfect
2   Poor        Poor       OK

In [47]:
df.replace('No','Ok',inplace=True)

In [48]:
df

       A           B        C
0  Awful        Poor       Ok
1     Ok  Acceptable  Perfect
2   Poor        Poor       Ok

In [1]:
df = pd.DataFrame({'Birth':['2019-01-01 09:10:00',
                            '2019-01-08 09:20:30',
                            '2019-02-01 10:20:00',
                            '2019-02-02 11:40:50',
                            '2019-02-28 15:10:20',
                            '2019-04-10 19:20:50',
                            '2019-06-30 21:20:50',
                            '2019-07-20 23:30:59']})

In [5]:
df['Birth'] = pd.to_datetime(df['Birth'])

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Birth   8 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 192.0 bytes

In [18]:
df['Birth'] = df['Birth'].apply(lambda x : '-'.join(str(x).split('-')[:2]))

In [20]:
df['Birth'] = pd.to_datetime(df['Birth'])

In [21]:
df

       Birth
0 2019-01-01
1 2019-01-01
2 2019-02-01
3 2019-02-01
4 2019-02-01
5 2019-04-01
6 2019-06-01
7 2019-07-01